Revit 2027 API
EnergyDataSettings.OutsideAirChangesRatePerHour Property
Note: This API is now obsolete.
 The number of times the volume of air interchanges in the room in one hour.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
[ObsoleteAttribute("Deprecated in Revit 2027 and may be removed in a later version of Revit.")]
public double OutsideAirChangesRatePerHour { get; set; }
<ObsoleteAttribute("Deprecated in Revit 2027 and may be removed in a later version of Revit.")>
Public Property OutsideAirChangesRatePerHour As Double
	Get
	Set
public:
[ObsoleteAttribute(L"Deprecated in Revit 2027 and may be removed in a later version of Revit.")]
property double OutsideAirChangesRatePerHour {
	double get ();
	void set (double value);
}
[<ObsoleteAttribute("Deprecated in Revit 2027 and may be removed in a later version of Revit.")>]
member OutsideAirChangesRatePerHour : float with get, set
Property Value
Double
Remarks
 This number is a format for expressing the requirement for airflow. The "flow" requirement for a room might be expressed, e.g., one room of 100 CF, and 3 Air Changes per Hour (ACH), would compute to 100 CF x 3 ACH / 60 min = 5 CFM.
See Also
Reference
EnergyDataSettings Class
Autodesk.Revit.DB.Analysis Namespace